Revit 2024 API
OrdinateDimensionSetting.OriginVisibility Property
 Specifies thevisibility of the origin witness line for the ordinate dimension (this is the first witness line in the string).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017 Subscription Update
Syntax
C#
public OrdinateOriginVisibility OriginVisibility { get; set; }
Visual Basic
Public Property OriginVisibility As OrdinateOriginVisibility
	Get
	Set
Visual C++
public:
property OrdinateOriginVisibility OriginVisibility {
	OrdinateOriginVisibility get ();
	void set (OrdinateOriginVisibility value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace